tap "homebrew/bundle"
tap "aws/tap"
tap "heroku/brew"

brew "zsh"
brew "zsh-completions"

# Networking
brew "putty"
brew "curl"
brew "openssl@3"
cask "ssh-tunnel-manager"
cask "tunnelblick"
cask "okta-advanced-server-access"
brew "speedtest-cli"
brew "bitwarden-cli"
brew "ca-certificates"
brew "wget"

# Build
brew "cmake"
brew "ansible"
brew "packer"

# Git
brew "git"
brew "git-secrets"
brew "pre-commit"

# dotnet
brew "dotnet"
# cask "dotnet-sdk"
# cask "mono-mdk"

# Java
brew "jenv"
brew "openjdk@8"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "gradle"
brew "maven"
cask "temurin17"

# Node
brew "nodenv"
brew "node@14"
brew "node@16"
brew "yarn"
brew "mockserver"
brew "gulp-cli"

# FE Frameworks
brew "angular-cli"

# Python
brew "python"
brew "virtualenv"

# Go
brew "go"

# Clojure
brew "leiningen"
brew "guile"	

# Scala
brew "coursier/formulas/coursier"
brew "scala"

# Docker
brew "docker"
# brew "docker-compose"
# brew "colima"
brew "podman"
brew "lima"

# Terraform
brew "terraform-docs"
brew "tfenv"
	
# Database
brew "postgresql@17"
brew "mongodb-atlas-cli"
brew "mysql"
brew "sqlite"

# Ruby
brew "rbenv"
brew "ruby-install"
brew "rust"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "kube-linter"	
brew "Azure/kubelogin/kubelogin"
brew "k9s"
brew "minikube"
brew "helm"	

# Tools
brew "asciidoc"
brew "pandoc"
brew "jq"
brew "yq"
brew "shellcheck"
brew "parallel"
brew "graphviz"
brew "watch"
brew "adr-tools"
brew "plantuml"
brew "d2"
cask "processing"

# AWS
brew "awscli"
brew "awsume"	
brew "aws-sam-cli"	

# Azure
brew "azure-cli"	

# Heroku
brew "heroku"

# Circle CI
brew "circleci"	

# Applications
cask "slack"
# cask "spotify"
cask "bitwarden"
cask "microsoft-office"
cask "microsoft-teams"
cask "firefox"
cask "whatsapp"
cask "zoom"
cask "raspberry-pi-imager"
cask "dbeaver-community"
cask "signal"
cask "insomnia"
cask "intellij-idea-ce"
# cask "visual-studio-code"